[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:82:17
             </Nav>
             <Nav className="mr-auto">
               {
-                hasRole(currentUser, "ROLE_USER") && (
-                  <NavDropdown title="Restaurants" id="appnavbar-restaurants-dropdown" data-testid="appnavbar-restaurants-dropdown" >
-                    <NavDropdown.Item href="/restaurants" data-testid="appnavbar-restaurants-list">List</NavDropdown.Item>
-                    {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">Create</NavDropdown.Item>
-                      )
-                    }
-                  </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_USER") || <NavDropdown title="Restaurants" id="appnavbar-restaurants-dropdown" data-testid="appnavbar-restaurants-dropdown">
+                    <NavDropdown.Item href="/restaurants" data-testid="appnavbar-restaurants-list">List</NavDropdown.Item>
+                    {hasRole(currentUser, "ROLE_ADMIN") && <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">Create</NavDropdown.Item>}
+                  </NavDropdown>
               }
             </Nav>
killedBy: AppNavbar tests user view: restaurant menu displayed correctly
statusReason: Error: Unable to find an element by: [data-testid="appnavbar-restaurants-dropdown"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:86:23
                   <NavDropdown title="Restaurants" id="appnavbar-restaurants-dropdown" data-testid="appnavbar-restaurants-dropdown" >
                     <NavDropdown.Item href="/restaurants" data-testid="appnavbar-restaurants-list">List</NavDropdown.Item>
                     {
-                      hasRole(currentUser, "ROLE_ADMIN") && (
-                        <NavDropdown.Item href="/restaurants/create" data-testid="appnavbar-restaurants-create">Create</NavDropdown.Item>
-                      )
+                      false
                     }
                   </NavDropdown>
killedBy: AppNavbar tests admin view: restaurant menu displayed correctly
statusReason: Error: Unable to find an element by: [data-testid="/appnavbar-restaurants-create/"]

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >
