[Killed] BlockStatement
main/components/Dogs/DogTable.js:9:47
 const showCell = (cell) => JSON.stringify(cell.row.values);
 
 
-const defaultDeleteCallback = async (cell) => {
-    console.log(`deleteCallback: ${showCell(cell)})`);
-    dogUtils.del(cell.row.values.id);
-}
+const defaultDeleteCallback = async (cell) => {}
 
 export default function DogTable({
killedBy: DogTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Dogs/DogTable.js:22:36
 
     const navigate = useNavigate();
  
-    const editCallback = (cell) => {
-        console.log(`editCallback: ${showCell(cell)})`);
-        navigate(`/dogs/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     const detailsCallback = (cell) => {
killedBy: DogTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/dogs/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/components/Dogs/DogTable.js:27:39
         navigate(`/dogs/edit/${cell.row.values.id}`)
     }
 
-    const detailsCallback = (cell) => {
-        console.log(`detailsCallback: ${showCell(cell)})`);
-        navigate(`/dogs/details/${cell.row.values.id}`)
-    }
+    const detailsCallback = (cell) => {}
 
     const columns = [
killedBy: DogTable tests Details button navigates to the details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/dogs/details/2"

Number of calls: 0

<html>
  <head />

[Killed] ArrayDeclaration
main/components/Dogs/DogTable.js:32:21
         navigate(`/dogs/details/${cell.row.values.id}`)
     }
 
-    const columns = [
-        {
-            Header: 'id',
-            accessor: 'id', // accessor is the "key" in the data
-        },
-
-        {
-            Header: 'Name',
-            accessor: 'name',
-        },
-        {
-            Header: 'Breed',
-            accessor: 'breed',
-        }
-    ];
+    const columns = [];
 
     const buttonColumns = [
killedBy: DogTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Dogs/DogTable.js:44:23
         },
         {
             Header: 'Breed',
-            accessor: 'breed',
+            accessor: "",
         }
     ];
killedBy: DogTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="DogTable-cell-row-0-col-breed"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrayDeclaration
main/components/Dogs/DogTable.js:48:27
         }
     ];
 
-    const buttonColumns = [
-        ...columns,
-        ButtonColumn("Details", "primary", detailsCallback, testIdPrefix),
-        ButtonColumn("Edit", "primary", editCallback, testIdPrefix),
-        ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
-    ]
+    const buttonColumns = []
 
     const columnsToDisplay = showButtons ? buttonColumns : columns;
killedBy: DogTable tests Has the expected column headers, content and buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
