[Killed] BlockStatement
main/pages/Dogs/DogDetailsPage.js:6:42
 import DogTable from 'main/components/Dogs/DogTable';
 import { dogUtils } from 'main/utils/dogUtils';
 
-export default function DogDetailsPage() {
-  let { id } = useParams();
-
-  const response = dogUtils.getById(id);
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Dog Details</h1>
-        <DogTable dogs={[response.dog]} showButtons={false} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function DogDetailsPage() {}
 
killedBy: DogDetailsPage tests renders without crashing
statusReason: Error: DogDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BooleanLiteral
main/pages/Dogs/DogDetailsPage.js:15:54
     <BasicLayout>
       <div className="pt-2">
         <h1>Dog Details</h1>
-        <DogTable dogs={[response.dog]} showButtons={false} />
+        <DogTable dogs={[response.dog]} showButtons={true} />
       </div>
     </BasicLayout>
killedBy: DogDetailsPage tests loads the correct fields, and no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Delete

Here are the matching elements:

<th
  colspan="1"
  data-testid="DogTable-header-Delete"
  role="columnheader"
