[Killed] BlockStatement
main/pages/Dogs/DogIndexPage.js:16:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`DogIndexPage deleteCallback: ${showCell(cell)})`);
-        dogUtils.del(cell.row.values.id);
-        navigate("/dogs/list");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: DogIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Dogs/DogIndexPage.js:19:18
     const deleteCallback = async (cell) => {
         console.log(`DogIndexPage deleteCallback: ${showCell(cell)})`);
         dogUtils.del(cell.row.values.id);
-        navigate("/dogs/list");
+        navigate("");
     }
 
killedBy: DogIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/dogs/list"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/pages/Dogs/DogIndexPage.js:25:41
     return (
         <BasicLayout>
             <div className="pt-2">
-                <Button style={{ float: "right" }} as={Link} to="/dogs/create">
+                <Button style={{ float: "" }} as={Link} to="/dogs/create">
                     Create Dog
                 </Button>
killedBy: DogIndexPage tests renders correct fields
statusReason: Error: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
