[Killed] BlockStatement
main/pages/Dogs/DogsCreatePage.js:6:42
 import { useNavigate } from 'react-router-dom'
 import { dogUtils } from 'main/utils/dogUtils';
 
-export default function DogsCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (dog) => {
-    const createdDog = dogUtils.add(dog);
-    console.log("createdDog: " + JSON.stringify(createdDog));
-    navigate("/dogs/list");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Dog!</h1>
-        <DogForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function DogsCreatePage() {}
 
killedBy: dogCreatePage tests renders without crashing
statusReason: Error: DogsCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Dogs/DogsCreatePage.js:10:35
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (dog) => {
-    const createdDog = dogUtils.add(dog);
-    console.log("createdDog: " + JSON.stringify(createdDog));
-    navigate("/dogs/list");
-  }  
+  const onSubmit = async (dog) => {}  
 
   return (
killedBy: dogCreatePage tests redirects to /dogs on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Dogs/DogsCreatePage.js:13:14
   const onSubmit = async (dog) => {
     const createdDog = dogUtils.add(dog);
     console.log("createdDog: " + JSON.stringify(createdDog));
-    navigate("/dogs/list");
+    navigate("");
   }  
 
killedBy: dogCreatePage tests redirects to /dogs on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/dogs/list"
Received: ""

Number of calls: 1

<html>
