[Killed] BlockStatement
main/pages/Dogs/DogsEditPage.js:9:39
 import { useNavigate } from 'react-router-dom'
 
 
-export default function DogEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = dogUtils.getById(id);
-
-    const onSubmit = async (dog) => {
-        const updateddog = dogUtils.update(dog);
-        console.log("updateddog: " + JSON.stringify(updateddog));
-        navigate("/dogs/list");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit dog</h1>
-                <DogForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.dog}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function DogEditPage() {}
killedBy: dogEditPage tests renders without crashing
statusReason: Error: DogEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Dogs/DogsEditPage.js:16:37
 
     const response = dogUtils.getById(id);
 
-    const onSubmit = async (dog) => {
-        const updateddog = dogUtils.update(dog);
-        console.log("updateddog: " + JSON.stringify(updateddog));
-        navigate("/dogs/list");
-    }  
+    const onSubmit = async (dog) => {}  
 
     return (
killedBy: dogEditPage tests redirects to /Dogs on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Dogs/DogsEditPage.js:18:21
 
     const onSubmit = async (dog) => {
         const updateddog = dogUtils.update(dog);
-        console.log("updateddog: " + JSON.stringify(updateddog));
+        console.log("" + JSON.stringify(updateddog));
         navigate("/dogs/list");
     }  
killedBy: dogEditPage tests redirects to /Dogs on submit
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "updateddog: {\"Dog\":{\"id\":3,\"name\":\"Tom\",\"breed\":\"German Shepherd\"}"
Received string:    "{\"Dog\":{\"id\":3,\"name\":\"Tom\",\"breed\":\"German Shepherd\"}}"
