[Killed] BlockStatement
src/main/utils/dogUtils.js:2:19
 // get dogs from local storage
-const get = () => {
-    const dogValue = localStorage.getItem("dogs");
-    if (dogValue === undefined) {
-        const dogCollection = { nextId: 1, dogs: [] }
-        return set(dogCollection);
-    }
-    const dogCollection = JSON.parse(dogValue);
-    if (dogCollection === null) {
-        const dogCollection = { nextId: 1, dogs: [] }
-        return set(dogCollection);
-    }
-    return dogCollection;
-};
+const get = () => {};
 
 const getById = (id) => {
killedBy: DogTable tests Delete button calls delete callback
statusReason: TypeError: Cannot read properties of undefined (reading 'dogs')

[Killed] BlockStatement
src/main/utils/dogUtils.js:4:33
 // get dogs from local storage
 const get = () => {
     const dogValue = localStorage.getItem("dogs");
-    if (dogValue === undefined) {
-        const dogCollection = { nextId: 1, dogs: [] }
-        return set(dogCollection);
-    }
+    if (dogValue === undefined) {}
     const dogCollection = JSON.parse(dogValue);
     if (dogCollection === null) {
killedBy: dogUtils tests get When dogs is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ConditionalExpression
src/main/utils/dogUtils.js:4:9
 // get dogs from local storage
 const get = () => {
     const dogValue = localStorage.getItem("dogs");
-    if (dogValue === undefined) {
+    if (false) {
         const dogCollection = { nextId: 1, dogs: [] }
         return set(dogCollection);
killedBy: dogUtils tests get When dogs is undefined in local storage, should set to empty list
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] ConditionalExpression
src/main/utils/dogUtils.js:9:9
         return set(dogCollection);
     }
     const dogCollection = JSON.parse(dogValue);
-    if (dogCollection === null) {
+    if (true) {
         const dogCollection = { nextId: 1, dogs: [] }
         return set(dogCollection);
killedBy: dogUtils tests get When dogs is [] in local storage, should return []
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "dogs", "{\"nextId\":1,\"dogs\":[]}"

[Killed] ConditionalExpression
src/main/utils/dogUtils.js:9:9
         return set(dogCollection);
     }
     const dogCollection = JSON.parse(dogValue);
-    if (dogCollection === null) {
+    if (false) {
         const dogCollection = { nextId: 1, dogs: [] }
         return set(dogCollection);
killedBy: dogUtils tests get When dogs is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"dogs": [], "nextId": 1}
Received: null

[Killed] ArrayDeclaration
src/main/utils/dogUtils.js:10:50
     }
     const dogCollection = JSON.parse(dogValue);
     if (dogCollection === null) {
-        const dogCollection = { nextId: 1, dogs: [] }
+        const dogCollection = { nextId: 1, dogs: ["Stryker was here"] }
         return set(dogCollection);
     }
killedBy: dogUtils tests get When dogs is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

  Object {
-   "dogs": Array [],
+   "dogs": Array [

[Killed] BlockStatement
src/main/utils/dogUtils.js:16:25
     return dogCollection;
 };
 
-const getById = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const dogCollection = get();
-    const dogs = dogCollection.dogs;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = dogs.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `dog with id ${id} not found` };
-    }
-    return { dog: dogs[index] };
-}
+const getById = (id) => {}
 
 // set dogs in local storage
killedBy: dogUtils tests getById Check that getting a dog by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"dog": {"breed": "German Shepherd", "gender": "Male", "id": 3, "name": "Tom"}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/dogUtils.js:24:41
     const dogs = dogCollection.dogs;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = dogs.findIndex((r) => r.id == id);
+    const index = dogs.findIndex((r) => false);
     if (index === -1) {
         return { "error": `dog with id ${id} not found` };
killedBy: dogUtils tests getById Check that getting a dog by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "dog": Object {
-     "breed": "German Shepherd",

[Killed] EqualityOperator
src/main/utils/dogUtils.js:24:41
     const dogs = dogCollection.dogs;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = dogs.findIndex((r) => r.id == id);
+    const index = dogs.findIndex((r) => r.id != id);
     if (index === -1) {
         return { "error": `dog with id ${id} not found` };
killedBy: dogUtils tests getById Check that getting a dog by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "dog": Object {
-     "breed": "German Shepherd",

[Killed] BlockStatement
src/main/utils/dogUtils.js:25:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = dogs.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `dog with id ${id} not found` };
-    }
+    if (index === -1) {}
     return { dog: dogs[index] };
 }
killedBy: dogUtils tests getById Check that getting a non-existing dog returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "dog with id 99 not found",
+   "dog": undefined,

[Killed] ConditionalExpression
src/main/utils/dogUtils.js:25:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = dogs.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (true) {
         return { "error": `dog with id ${id} not found` };
     }
killedBy: dogUtils tests getById Check that getting a dog by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
-   "dog": Object {
-     "breed": "German Shepherd",

[Killed] BlockStatement
src/main/utils/dogUtils.js:32:32
 }
 
 // set dogs in local storage
-const set = (dogCollection) => {
-    localStorage.setItem("dogs", JSON.stringify(dogCollection));
-    return dogCollection;
-};
+const set = (dogCollection) => {};
 
 // add a dog to local storage
killedBy: dogUtils tests get When dogs is undefined in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"dogs": [], "nextId": 1}
Received: undefined

[Killed] StringLiteral
src/main/utils/dogUtils.js:33:26
 
 // set dogs in local storage
 const set = (dogCollection) => {
-    localStorage.setItem("dogs", JSON.stringify(dogCollection));
+    localStorage.setItem("", JSON.stringify(dogCollection));
     return dogCollection;
 };
killedBy: dogUtils tests get When dogs is undefined in local storage, should set to empty list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "dogs", "{\"nextId\":1,\"dogs\":[]}"
Received: "", "{\"nextId\":1,\"dogs\":[]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/dogUtils.js:38:22
 };
 
 // add a dog to local storage
-const add = (dog) => {
-    const dogCollection = get();
-    dog = { ...dog, id: dogCollection.nextId };
-    dogCollection.nextId++;
-    dogCollection.dogs.push(dog);
-    set(dogCollection);
-    return dog;
-};
+const add = (dog) => {};
 
 // update a dog in local storage
killedBy: dogUtils tests add Starting from [], check that adding one dog works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"breed": "Yorkie", "gender": "Male", "id": 1, "name": "Max"}
Received: undefined

[Killed] UpdateOperator
src/main/utils/dogUtils.js:41:5
 const add = (dog) => {
     const dogCollection = get();
     dog = { ...dog, id: dogCollection.nextId };
-    dogCollection.nextId++;
+    dogCollection.nextId--;
     dogCollection.dogs.push(dog);
     set(dogCollection);
killedBy: dogUtils tests add Starting from [], check that adding one dog works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "dogs", "{\"nextId\":2,\"dogs\":[{\"id\":1,\"name\":\"Max\",\"breed\":\"Yorkie\",\"gender\":\"Male\"}]}"
Received: "dogs", "{\"nextId\":0,\"dogs\":[{\"id\":1,\"name\":\"Max\",\"breed\":\"Yorkie\",\"gender\":\"Male\"}]}"

Number of calls: 1

[Killed] BlockStatement
src/main/utils/dogUtils.js:48:25
 };
 
 // update a dog in local storage
-const update = (dog) => {
-    const dogCollection = get();
-
-    const dogs = dogCollection.dogs;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = dogs.findIndex((r) => r.id == dog.id);
-    if (index === -1) {
-        return { "error": `dog with id ${dog.id} not found` };
-    }
-    dogs[index] = dog;
-    set(dogCollection);
-    return { dogCollection: dogCollection };
-};
+const update = (dog) => {};
 
 // delete a dog from local storage
killedBy: dogUtils tests update Check that updating an existing dog works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"dogCollection": {"dogs": [{"breed": "Poodle", "gender": "Female", "id": 2, "name": "Updated Name"}, {"breed": "German Shepherd", "gender": "Male", "id": 3, "name": "Tom"}, {"breed": "Golden Retriever", "gender": "Female", "id": 4, "name": "Lucy"}], "nextId": 5}}
Received: undefined

[Killed] ConditionalExpression
src/main/utils/dogUtils.js:54:41
     const dogs = dogCollection.dogs;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = dogs.findIndex((r) => r.id == dog.id);
+    const index = dogs.findIndex((r) => true);
     if (index === -1) {
         return { "error": `dog with id ${dog.id} not found` };
killedBy: dogUtils tests update Check that updating an non-existing dog returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 22

  Object {
-   "error": "dog with id 99 not found",
+   "dogCollection": Object {

[Killed] ConditionalExpression
src/main/utils/dogUtils.js:54:41
     const dogs = dogCollection.dogs;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = dogs.findIndex((r) => r.id == dog.id);
+    const index = dogs.findIndex((r) => false);
     if (index === -1) {
         return { "error": `dog with id ${dog.id} not found` };
killedBy: dogUtils tests update Check that updating an existing dog works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 23
+ Received  +  1

  Object {
-   "dogCollection": Object {
-     "dogs": Array [

[Killed] ConditionalExpression
src/main/utils/dogUtils.js:55:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = dogs.findIndex((r) => r.id == dog.id);
-    if (index === -1) {
+    if (false) {
         return { "error": `dog with id ${dog.id} not found` };
     }
killedBy: dogUtils tests update Check that updating an non-existing dog returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "dog with id 99 not found",
+   "dogCollection": Object {

[Killed] BlockStatement
src/main/utils/dogUtils.js:55:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = dogs.findIndex((r) => r.id == dog.id);
-    if (index === -1) {
-        return { "error": `dog with id ${dog.id} not found` };
-    }
+    if (index === -1) {}
     dogs[index] = dog;
     set(dogCollection);
killedBy: dogUtils tests update Check that updating an non-existing dog returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "dog with id 99 not found",
+   "dogCollection": Object {

[Killed] BlockStatement
src/main/utils/dogUtils.js:64:21
 };
 
 // delete a dog from local storage
-const del = (id) => {
-    if (id === undefined) {
-        return { "error": "id is a required parameter" };
-    }
-    const dogCollection = get();
-    const dogs = dogCollection.dogs;
-
-    /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = dogs.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `dog with id ${id} not found` };
-    }
-    dogs.splice(index, 1);
-    set(dogCollection);
-    return { dogCollection: dogCollection };
-};
+const del = (id) => {};
 
 const dogUtils = {
killedBy: dogUtils tests del Check that deleting a dog by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"dogCollection": {"dogs": [{"breed": "Poodle", "gender": "Female", "id": 2, "name": "Annie"}, {"breed": "Golden Retriever", "gender": "Female", "id": 4, "name": "Lucy"}], "nextId": 5}}
Received: undefined

[Killed] ArrowFunction
src/main/utils/dogUtils.js:72:34
     const dogs = dogCollection.dogs;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = dogs.findIndex((r) => r.id == id);
+    const index = dogs.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `dog with id ${id} not found` };
killedBy: dogUtils tests del Check that deleting a dog by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "dogCollection": Object {
-     "dogs": Array [

[Killed] UnaryOperator
src/main/utils/dogUtils.js:73:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = dogs.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `dog with id ${id} not found` };
     }
killedBy: dogUtils tests del Check that deleting a dog by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 17
+ Received  +  1

  Object {
-   "dogCollection": Object {
-     "dogs": Array [

[Killed] ObjectLiteral
src/main/utils/dogUtils.js:78:12
     }
     dogs.splice(index, 1);
     set(dogCollection);
-    return { dogCollection: dogCollection };
+    return {};
 };
 
killedBy: dogUtils tests del Check that deleting a dog by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 19
+ Received  +  1

- Object {
-   "dogCollection": Object {
-     "dogs": Array [
