[Killed] BooleanLiteral
main/components/Restaurants/RestaurantTable.js:10:17
 
 export default function RestaurantTable({
   restaurants,
-  showButtons = true,
+  showButtons = false,
   testIdPrefix = "RestaurantTable",
   currentUser = null,
killedBy: RestaurantIndexPage tests renders three restaurants correctly for regular user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-Details-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/components/Restaurants/RestaurantTable.js:14:44
   testIdPrefix = "RestaurantTable",
   currentUser = null,
 }) {
-  const handleDeleteSuccess = (message) => {
-    console.log(message);
-    toast(message);
-  };
+  const handleDeleteSuccess = (message) => {};
 
   const createAxiosParams = (cell) => ({
killedBy: RestaurantTable tests Delete button calls delete callback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrowFunction
main/components/Restaurants/RestaurantTable.js:19:29
     toast(message);
   };
 
-  const createAxiosParams = (cell) => ({
-    url: "/api/Restaurant",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  });
+  const createAxiosParams = () => undefined;
   // Stryker disable all : don't test internal caching of React Query
   const deleteMutation = useBackendMutation(createAxiosParams, { onSuccess: handleDeleteSuccess }, [
killedBy: RestaurantTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:20:10
   };
 
   const createAxiosParams = (cell) => ({
-    url: "/api/Restaurant",
+    url: "",
     method: "DELETE",
     params: {
killedBy: RestaurantTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/Restaurant"
Received: ""

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Restaurants/RestaurantTable.js:21:13
 
   const createAxiosParams = (cell) => ({
     url: "/api/Restaurant",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.values.id,
killedBy: RestaurantTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
