[Killed] BlockStatement
main/pages/Restaurants/RestaurantCreatePage.js:7:48
 import axios from "axios";
 import { toast } from 'react-toastify';
 
-const createRestaurant = async (restaurant) => {
-
-    const response = await axios.post("/api/Restaurant/post", null, {
-      params: {
-        name: restaurant.name,
-        description: restaurant.description,
-      },
-    });
-
-    return response.data;
-  
-};
+const createRestaurant = async (restaurant) => {};
 
 export default function RestaurantCreatePage() {
killedBy: RestaurantCreatePage tests when filled in and submitted, makes request to backend and redirects to index page
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
main/pages/Restaurants/RestaurantCreatePage.js:20:48
   
 };
 
-export default function RestaurantCreatePage() {
-  let navigate = useNavigate();
-
-  const onSubmit = async (restaurant) => {
-   // Stryker disable next-line al
-      const createdRestaurant = await createRestaurant(restaurant);
-      //Stryker disable next-line all: console.log is not a security risk
-      console.log("createdRestaurant: " + JSON.stringify(createdRestaurant));
-      toast(`New restaurant Created - id: ${createdRestaurant.id} name: ${createdRestaurant.name}`);
-      navigate("/restaurants");
-
-  };
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Restaurant</h1>
-        <RestaurantForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  );
-}
+export default function RestaurantCreatePage() {}
 
killedBy: RestaurantCreatePage tests renders without crashing
statusReason: Error: RestaurantCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Restaurants/RestaurantCreatePage.js:23:42
 export default function RestaurantCreatePage() {
   let navigate = useNavigate();
 
-  const onSubmit = async (restaurant) => {
-   // Stryker disable next-line al
-      const createdRestaurant = await createRestaurant(restaurant);
-      //Stryker disable next-line all: console.log is not a security risk
-      console.log("createdRestaurant: " + JSON.stringify(createdRestaurant));
-      toast(`New restaurant Created - id: ${createdRestaurant.id} name: ${createdRestaurant.name}`);
-      navigate("/restaurants");
-
-  };
+  const onSubmit = async (restaurant) => {};
 
   return (
killedBy: RestaurantCreatePage tests when filled in and submitted, makes request to backend and redirects to index page
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Restaurants/RestaurantCreatePage.js:28:13
       const createdRestaurant = await createRestaurant(restaurant);
       //Stryker disable next-line all: console.log is not a security risk
       console.log("createdRestaurant: " + JSON.stringify(createdRestaurant));
-      toast(`New restaurant Created - id: ${createdRestaurant.id} name: ${createdRestaurant.name}`);
+      toast(``);
       navigate("/restaurants");
 
killedBy: RestaurantCreatePage tests when filled in and submitted, makes request to backend and redirects to index page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New restaurant Created - id: 3 name: South Coast Deli"
Received: ""

Number of calls: 1

[Killed] StringLiteral
main/pages/Restaurants/RestaurantCreatePage.js:29:16
       //Stryker disable next-line all: console.log is not a security risk
       console.log("createdRestaurant: " + JSON.stringify(createdRestaurant));
       toast(`New restaurant Created - id: ${createdRestaurant.id} name: ${createdRestaurant.name}`);
-      navigate("/restaurants");
+      navigate("");
 
   };
killedBy: RestaurantCreatePage tests when filled in and submitted, makes request to backend and redirects to index page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/restaurants"
Received: ""

Number of calls: 1
