[Killed] BlockStatement
main/pages/Restaurants/RestaurantDetailsPage.js:6:49
 import RestaurantTable from 'main/components/Restaurants/RestaurantTable';
 import {useBackend} from "../../utils/useBackend";
 
-export default function RestaurantDetailsPage() {
-  let {id} = useParams();
-
-  const {data: restaurant, error, status} =
-    useBackend(
-      // Stryker disable next-line all : don't test internal caching of React Query
-      [`/api/Restaurant?id=${id}`],
-      {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET",
-        url: `/api/Restaurant`,
-        params: {id}
-      }
-    );
-
-  const restaurants = restaurant ? [restaurant] : [];
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Restaurant Details</h1>
-        <RestaurantTable restaurants={restaurants} showButtons={false}/>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function RestaurantDetailsPage() {}
 
killedBy: RestaurantDetailsPage tests renders headers only when backend doesn't return a restaurant
statusReason: Error: RestaurantDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrayDeclaration
main/pages/Restaurants/RestaurantDetailsPage.js:20:51
       }
     );
 
-  const restaurants = restaurant ? [restaurant] : [];
+  const restaurants = restaurant ? [restaurant] : ["Stryker was here"];
 
   return (
killedBy: RestaurantDetailsPage tests renders headers only when backend doesn't return a restaurant
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RestaurantTable-cell-row-0-col-id" role="cell" /> instead

[Killed] BooleanLiteral
main/pages/Restaurants/RestaurantDetailsPage.js:26:65
     <BasicLayout>
       <div className="pt-2">
         <h1>Restaurant Details</h1>
-        <RestaurantTable restaurants={restaurants} showButtons={false}/>
+        <RestaurantTable restaurants={restaurants} showButtons={true}/>
       </div>
     </BasicLayout>
killedBy: RestaurantDetailsPage tests when backend returns a restaurant loads the correct fields, and has no buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Details

Here are the matching elements:

<th
  colspan="1"
  data-testid="RestaurantTable-header-Details"
  role="columnheader"
