[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.js:13:5
   const {data: restaurant} =     useBackend(
     //Stryker disable next-line all 
     [`/api/Restaurant?id=${id}`],
-    {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/Restaurant`,
-      params: {id}
-    }
+    {}
   );
 
killedBy: EditRestaurantPage tests functional API populates form with existing restaurant data
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/Restaurants/RestaurantEditPage.js:20:34
     }
   );
 
-  const objectToAxiosPutParams = (restaurant) => ({
-    url: "/api/Restaurant",
-    method: "PUT",
-    params: {id: restaurant.id},
-    data: {
-      name: restaurant.name,
-      description: restaurant.description,
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (restaurant) => {
killedBy: EditRestaurantPage tests functional API on form submit, calls API and navigates to restaurant list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Restaurant Updated - id: 3 name: JONAHTNAN"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantEditPage.js:20:51
     }
   );
 
-  const objectToAxiosPutParams = (restaurant) => ({
-    url: "/api/Restaurant",
-    method: "PUT",
-    params: {id: restaurant.id},
-    data: {
-      name: restaurant.name,
-      description: restaurant.description,
-    }
-  });
+  const objectToAxiosPutParams = (restaurant) => ({});
 
   const onSuccess = (restaurant) => {
killedBy: EditRestaurantPage tests functional API on form submit, calls API and navigates to restaurant list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Restaurant Updated - id: 3 name: JONAHTNAN"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/Restaurants/RestaurantEditPage.js:35:42
   };
 //Stryker disable next-line all 
   const mut = useBackendMutation(objectToAxiosPutParams, {onSuccess}, [`/api/restaurants?id=${id}`]);
-  const onSubmit = async (restaurant) => {
-    mut.mutate(restaurant);
-  };
+  const onSubmit = async (restaurant) => {};
 
   if (mut.isSuccess) {
killedBy: EditRestaurantPage tests functional API on form submit, calls API and navigates to restaurant list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Restaurant Updated - id: 3 name: JONAHTNAN"

Number of calls: 0

<html>
  <head />

[Killed] BlockStatement
main/pages/Restaurants/RestaurantEditPage.js:39:22
     mut.mutate(restaurant);
   };
 
-  if (mut.isSuccess) {
-    return <Navigate to="/restaurants"/>;
-  }
+  if (mut.isSuccess) {}
 
   return (
killedBy: EditRestaurantPage tests functional API on form submit, calls API and navigates to restaurant list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/restaurants"}

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.js:39:7
     mut.mutate(restaurant);
   };
 
-  if (mut.isSuccess) {
+  if (true) {
     return <Navigate to="/restaurants"/>;
   }
killedBy: EditRestaurantPage tests when API does not return a restaurant renders headline only
statusReason: Error: Unable to find an element with the text: Edit Restaurant. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div />
</body>

[Killed] LogicalOperator
main/pages/Restaurants/RestaurantEditPage.js:48:11
       <div className="pt-2">
         <h1>Edit Restaurant</h1>
         {
-          restaurant &&
-          <RestaurantForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={restaurant}/>
+          restaurant || <RestaurantForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={restaurant} />
         }
       </div>
killedBy: EditRestaurantPage tests when API does not return a restaurant renders headline only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="RestaurantForm-name" id="name" name="name" type="text" /> instead

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.js:48:11
       <div className="pt-2">
         <h1>Edit Restaurant</h1>
         {
-          restaurant &&
-          <RestaurantForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={restaurant}/>
+          true
         }
       </div>
killedBy: EditRestaurantPage tests functional API populates form with existing restaurant data
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
