[Killed] BlockStatement
main/pages/Restaurants/RestaurantIndexPage.js:9:47
 import { useBackend } from "../../utils/useBackend";
 import { useCurrentUser } from "../../utils/currentUser";
 
-export default function RestaurantIndexPage() {
-  // Stryker disable all : don't test internal caching of React Query
-  const { data: restaurants } =     useBackend(
-  
-    ["Get all restaurants"],
-    {method: "GET", url: "/api/Restaurant/all"},
-    []
-  );;
-  // Stryker enable all
-  const currentUser = useCurrentUser();
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <Button style={{ float: "right" }} as={Link} to="/restaurants/create">
-          Create Restaurant
-        </Button>
-        <h1>Restaurants</h1>
-        <RestaurantTable restaurants={restaurants} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  );
-}
+export default function RestaurantIndexPage() {}
killedBy: RestaurantIndexPage tests renders without crashing for normal user
statusReason: Error: RestaurantIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
